import db from '../db.js';

function initPositions() {
  return new Promise((resolve, reject) => {
    db.run(`
      CREATE TABLE IF NOT EXISTS positions (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        position TEXT NOT NULL,
        section TEXT NOT NULL,
        rate REAL NOT NULL DEFAULT 1,
        unit TEXT
      )
    `, (err) => {
      if (err) return reject(err);

      // Перевірка, чи таблиця порожня
      db.get('SELECT COUNT(*) AS count FROM positions', (err, row) => {
        if (err) return reject(err);

        if (row.count === 0) {
          // Вставка початкових даних
          const insert = db.prepare(`INSERT INTO positions (position, section, unit) VALUES (?, ?, ?)`);
          //АДМІНІСТРАТИВНО-УПРАВЛІНСЬКИЙ ПЕРСОНАЛ
          insert.run('Директор-художній керівник театру', 'Адміністративно-управлінський персонал', null);
          insert.run('Заступник директора з організаційної роботи', 'Адміністративно-управлінський персонал', null);
          insert.run('Заступник директора по організації глядача', 'Адміністративно-управлінський персонал', null);
          insert.run('Головний бухгалтер', 'Адміністративно-управлінський персонал', null);
          insert.run('Головний інженер', 'Адміністративно-управлінський персонал', null);
          insert.run('Головний адміністратор', 'Адміністративно-управлінський персонал', null);
          insert.run('Старший адміністратор', 'Адміністративно-управлінський персонал', null);
          insert.run('Провідний економіст', 'Адміністративно-управлінський персонал', null);
          insert.run('Провідний бухгалтер', 'Адміністративно-управлінський персонал', null);
          insert.run('Заступник начальника відділу правового та кадрового забезпечення', 'Адміністративно-управлінський персонал', null);
          insert.run('Завідувач центральним складом', 'Адміністративно-управлінський персонал', null);
          insert.run('Заступник головного бухгалтера', 'Адміністративно-управлінський персонал', null);
          insert.run('Начальник відділу правового та кадрового забезпечення ', 'Адміністративно-управлінський персонал', null);
          insert.run('Фахівець з публічних закупівель', 'Адміністративно-управлінський персонал', null);
          insert.run('Провідний юрисконсульт', 'Адміністративно-управлінський персонал', null);
          insert.run('Завідувач господарством', 'Адміністративно-управлінський персонал', null);
          insert.run('Завідувач архіву', 'Адміністративно-управлінський персонал', null);
          //ХУДОЖНІЙ ПЕРСОНАЛ
          insert.run('Головний режисер', 'Художній персонал', null);

          insert.run('Режисер-постановник', 'Художній персонал', null);
          insert.run('Режисер-постановник', 'Художній персонал', null);

          insert.run('Помічник художнього керівника', 'Художній персонал', null);
          insert.run('Головний художник', 'Художній персонал', null);
          insert.run('Художник-постановник', 'Художній персонал', null);
          insert.run('Головний диригент', 'Художній персонал', null);
          insert.run('Концертмейстер з класу вокалу', 'Художній персонал', null);
          insert.run('Керівник літературно-драматургічної частини', 'Художній персонал', null);
          insert.run('Помічник головного режисера', 'Художній персонал', null);

          insert.run('Помічник режисера', 'Художній персонал', null);
          insert.run('Помічник режисера', 'Художній персонал', null);

          insert.run('Завідувач трупи', 'Художній персонал', null);
          insert.run('Завідувач художньо-постановочної частини', 'Художній персонал', null);
          insert.run('Головний балетмейстер', 'Художній персонал', null);
          //АРТИСТИЧНИЙ ПЕРСОНАЛ
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);
          insert.run('Артист драми провідний майстер сцени', 'Артистичний персонал', null);

          insert.run('Артист драми вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист драми вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист драми вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист драми вищої категорії', 'Артистичний персонал', null);

          insert.run('Артист-вокаліст вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист-вокаліст вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист-вокаліст вищої категорії', 'Артистичний персонал', null);

          insert.run('Артист-вокаліст 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист-вокаліст 2 категорії', 'Артистичний персонал', null);

          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 1 категорії', 'Артистичний персонал', null);

          insert.run('Артист драми 2 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 2 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 2 категорії', 'Артистичний персонал', null);
          insert.run('Артист драми 2 категорії', 'Артистичний персонал', null);

          insert.run('Артист балету вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист балету вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист балету вищої категорії', 'Артистичний персонал', null);
          insert.run('Артист балету вищої категорії', 'Артистичний персонал', null);

          insert.run('Артист балету 1 категорії', 'Артистичний персонал', null);
          insert.run('Артист балету 1 категорії', 'Артистичний персонал', null);

          insert.run('Артист балету 2 категорії', 'Артистичний персонал', null);
          insert.run('Артист балету 2 категорії', 'Артистичний персонал', null);
          insert.run('Артист балету 2 категорії', 'Артистичний персонал', null);

          insert.run('Артист допоміжного складу', 'Артистичний персонал', null);
          insert.run('Артист допоміжного складу', 'Артистичний персонал', null);
          insert.run('Артист допоміжного складу', 'Артистичний персонал', null);
          insert.run('Артист допоміжного складу', 'Артистичний персонал', null);
          insert.run('Артист допоміжного складу', 'Артистичний персонал', null);
          //АРТИСТИ ОРКЕСТРУ
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру вищої категорії', 'Артисти оркестру', null);

          insert.run('Артист оркестру 1 категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру 1 категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру 1 категорії', 'Артисти оркестру', null);
          insert.run('Артист оркестру 1 категорії', 'Артисти оркестру', null);

          insert.run('Артист оркестру допоміжного складу', 'Артисти оркестру', null);
          insert.run('Артист оркестру допоміжного складу', 'Артисти оркестру', null);
          insert.run('Артист оркестру допоміжного складу', 'Артисти оркестру', null);
          //ТЕХНІЧНО-ЕКСПЛУАТАЦІЙНІ, ВИРОБНИЧІ, ІНШІ (ВІДДІЛИ,СЛУЖБИ,ЦЕХИ,ДІЛЬНИЦІ)
          //КОСТЮМЕРНИЙ ЦЕХ
          insert.run('Начальник костюмерного цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Костюмерний цех');
          insert.run('Начальник костюмерного цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Костюмерний цех');
          insert.run('Начальник костюмерного цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Костюмерний цех');
          //РЕКВІЗИТОРСЬКО-БУТАФОРСЬКИЙ ЦЕХ
          insert.run('Начальник реквізиторсько-бутафорного цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Реквізиторсько-бутафорський цех');
          insert.run('Реквізитор 6 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Реквізиторсько-бутафорський цех');
          insert.run('Художник-бутафор', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Реквізиторсько-бутафорський цех');
          insert.run('Бутафор 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Реквізиторсько-бутафорський цех');
          //КРАВЕЦЬКИЙ ЦЕХ
          insert.run('Начальник кравецького цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Кравецький цех');
          insert.run('Закрійник', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Кравецький цех');
          insert.run('Закрійник', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Кравецький цех');
          insert.run('Закрійник', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Кравецький цех');
          //ОСВІТЛЮВАЛЬНИЙ ТА ЗВУКОВИЙ ЦЕХ
          insert.run('Начальник освітлюваного та звукового цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          insert.run('Інженер-електронік', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          insert.run('Освітлювач', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          insert.run('Освітлювач (який веде розробку схем освітлення вистав)', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          insert.run('Звукорежисер вищої категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          insert.run('Звукорежисер вищої категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          insert.run('Звукорежисер вищої категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Освітлювальний та звуковий цех');
          //МАШИННО-ДЕКОРАЦІЙНИЙ ЦЕХ
          insert.run('Начальник машинно-декораційного цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Машино-декораційни цех');
          insert.run('Машиніст сцени 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Машино-декораційни цех');
          insert.run('Машиніст сцени 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Машино-декораційни цех');
          insert.run('Машиніст сцени 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Машино-декораційни цех');
          //СТОЛЯРНИЙ ЦЕХ
          insert.run('Начальник столярного цеху', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Столярний цех');
          insert.run('Електрозварник ручного зварювання 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Столярний цех');
          insert.run('Тесляр 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Столярний цех');
          //ДОПОМІЖНА СЛУЖБА
          insert.run('Художник-гример', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Допоміжна служба');
          insert.run('Художник-декоратор', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Допоміжна служба');
          insert.run('Фахівець з комп’ютерної графіки(дизайну)', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Допоміжна служба');
          insert.run('Гример-пастижер 6 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Допоміжна служба');
          insert.run('Провідний бібліотекар', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Допоміжна служба');
          //ТЕХНІЧНА СЛУЖБА
          insert.run('Інженер з охорони праці 1 категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Інженер-енергетик', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');

          insert.run('Технік електрик 1 категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Технік електрик 1 категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');

          insert.run('Інженер по обслуговуванню обладнання', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');

          insert.run('Технік 1 категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Технік 1 категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');

          insert.run('Інженер газової установки 1 категорії', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');

          insert.run('Слюсар-сантехнік 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Слюсар-сантехнік 5 розряду', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          
          insert.run('Інструктор з пожежної профілактики', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');

          insert.run('Пожежний', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Пожежний', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Пожежний', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          insert.run('Пожежний', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Технічна служба');
          //ГОСПОДАРСЬКА СЛУЖБА
          insert.run('Завідувач квиткової каси', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Касир', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Касир квитковий', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Старший контролер квитків', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');

          insert.run('Контролер квитків', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Контролер квитків', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Контролер квитків', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');

          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Прибиральник службових приміщень', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');

          insert.run('Двірник', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          
          insert.run('Сторож', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Сторож', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Сторож', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Сторож', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');

          insert.run('Машиніст із прання та ремонту спец.одягу', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          
          insert.run('Водій автотранспортного засобу (автомобіль середнього класу, фургон 3-5 т, робочий обєм двигуна 2,5 л)', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');
          insert.run('Водій автотранспортного засобу (автобус великого класу, довжина понад 9,5 м)', 'технічно-експлуатаційні, виробничі, інші (відділи,служби,цехи,дільниці)', 'Господарська служба');

          insert.finalize();
          console.log('Positions table initialized with seed data');
        }
        resolve();
      });
    });
  });
}

export default {
  initPositions
};
